In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns = ["Name", "Age", "Height"])

In [3]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [6]:
# add data
# 不建議List內有不同型別, 牽扯到資料結構與演算法運行
df.loc[0] = ["Allen", 22, 175]
df.loc[1] = ["Jack", 28, 177]
df.loc[2] = ["Ted", 25, 180]
df

    Name  Age  Height
0  Allen   22     175
1   Jack   28     177
2    Ted   25     180

In [8]:
# select column (Series, 一維結構)
df["Age"]

0    22
1    28
2    25
Name: Age, dtype: int64

In [10]:
# add column
df["weight"] = [60, 70, 75]
df

    Name  Age  Height  weight
0  Allen   22     175      60
1   Jack   28     177      70
2    Ted   25     180      75

In [15]:
# drop column
# df.drop["weight",]  # 預設是橫向刪除, 橫向並沒有 "weight"
df.drop(["weight"], axis=1) # 改成縱向刪除

    Name  Age  Height
0  Allen   22     175
1   Jack   28     177
2    Ted   25     180

In [16]:
# 並未真的刪除
df

    Name  Age  Height  weight
0  Allen   22     175      60
1   Jack   28     177      70
2    Ted   25     180      75

In [17]:
# 要 assign資料的狀態才算真正的刪除
df = df.drop(["weight"], axis=1)
df

    Name  Age  Height
0  Allen   22     175
1   Jack   28     177
2    Ted   25     180

In [23]:
# Drop a row
df = df.drop(2)
df

    Name  Age  Height
0  Allen   22     190
1   Jack   28     190

In [22]:
# 只給一個值，代表全部修改
df["Height"] = 190
df

    Name  Age  Height
0  Allen   22     190
1   Jack   28     190

In [27]:
# combine two list to tables
columns = ["Name", "Age", "Height"]
data = [["Mark", "21", "168"], ["Ray", "30", "182"]]
df2 = pd.DataFrame(data=data, columns=columns)
df2

   Name Age Height
0  Mark  21    168
1   Ray  30    182

In [28]:
# union two dataframe (dataframe必須是一樣的)
df_union = pd.concat([df, df2])
df_union

    Name Age Height
0  Allen  22    190
1   Jack  28    190
0   Mark  21    168
1    Ray  30    182

In [32]:
# union後index不會重置，所以要讓他reset
df_union = pd.concat([df, df2]).reset_index(drop=True)
df_union

# 輸出.csv 且不顯示index
df_union.to_csv("basic.csv",index=False)

In [33]:
# 不存欄位名的資料
df_union.to_csv("basic_no_column.csv",
                index=False,
                header=None)